grevaillot/svd_tools/headers/ATSAMV71Q20B/pioe.h
#pragma once 

/* --- PIOE: Parallel Input/Output Controller ----------------------- */

/** @defgroup pioe_registers Parallel Input/Output Controller Register
@{*/

/** PIOE_PIO_PER PIO Enable Register **/
#define PIOE_PIO_PER			MMIO32(PIOE_BASE + 0x00)
/** PIOE_PIO_PDR PIO Disable Register **/
#define PIOE_PIO_PDR			MMIO32(PIOE_BASE + 0x04)
/** PIOE_PIO_PSR PIO Status Register **/
#define PIOE_PIO_PSR			MMIO32(PIOE_BASE + 0x08)
/** PIOE_PIO_OER Output Enable Register **/
#define PIOE_PIO_OER			MMIO32(PIOE_BASE + 0x10)
/** PIOE_PIO_ODR Output Disable Register **/
#define PIOE_PIO_ODR			MMIO32(PIOE_BASE + 0x14)
/** PIOE_PIO_OSR Output Status Register **/
#define PIOE_PIO_OSR			MMIO32(PIOE_BASE + 0x18)
/** PIOE_PIO_IFER Glitch Input Filter Enable Register **/
#define PIOE_PIO_IFER			MMIO32(PIOE_BASE + 0x20)
/** PIOE_PIO_IFDR Glitch Input Filter Disable Register **/
#define PIOE_PIO_IFDR			MMIO32(PIOE_BASE + 0x24)
/** PIOE_PIO_IFSR Glitch Input Filter Status Register **/
#define PIOE_PIO_IFSR			MMIO32(PIOE_BASE + 0x28)
/** PIOE_PIO_SODR Set Output Data Register **/
#define PIOE_PIO_SODR			MMIO32(PIOE_BASE + 0x30)
/** PIOE_PIO_CODR Clear Output Data Register **/
#define PIOE_PIO_CODR			MMIO32(PIOE_BASE + 0x34)
/** PIOE_PIO_ODSR Output Data Status Register **/
#define PIOE_PIO_ODSR			MMIO32(PIOE_BASE + 0x38)
/** PIOE_PIO_PDSR Pin Data Status Register **/
#define PIOE_PIO_PDSR			MMIO32(PIOE_BASE + 0x3c)
/** PIOE_PIO_IER Interrupt Enable Register **/
#define PIOE_PIO_IER			MMIO32(PIOE_BASE + 0x40)
/** PIOE_PIO_IDR Interrupt Disable Register **/
#define PIOE_PIO_IDR			MMIO32(PIOE_BASE + 0x44)
/** PIOE_PIO_IMR Interrupt Mask Register **/
#define PIOE_PIO_IMR			MMIO32(PIOE_BASE + 0x48)
/** PIOE_PIO_ISR Interrupt Status Register **/
#define PIOE_PIO_ISR			MMIO32(PIOE_BASE + 0x4c)
/** PIOE_PIO_MDER Multi-driver Enable Register **/
#define PIOE_PIO_MDER			MMIO32(PIOE_BASE + 0x50)
/** PIOE_PIO_MDDR Multi-driver Disable Register **/
#define PIOE_PIO_MDDR			MMIO32(PIOE_BASE + 0x54)
/** PIOE_PIO_MDSR Multi-driver Status Register **/
#define PIOE_PIO_MDSR			MMIO32(PIOE_BASE + 0x58)
/** PIOE_PIO_PUDR Pull-up Disable Register **/
#define PIOE_PIO_PUDR			MMIO32(PIOE_BASE + 0x60)
/** PIOE_PIO_PUER Pull-up Enable Register **/
#define PIOE_PIO_PUER			MMIO32(PIOE_BASE + 0x64)
/** PIOE_PIO_PUSR Pad Pull-up Status Register **/
#define PIOE_PIO_PUSR			MMIO32(PIOE_BASE + 0x68)
/** PIOE_PIO_ABCDSR[0] Peripheral ABCD Select Register 0 **/
#define PIOE_PIO_ABCDSR[0]			MMIO32(PIOE_BASE + 0x70)
/** PIOE_PIO_ABCDSR[1] Peripheral ABCD Select Register 0 **/
#define PIOE_PIO_ABCDSR[1]			MMIO32(PIOE_BASE + 0x74)
/** PIOE_PIO_IFSCDR Input Filter Slow Clock Disable Register **/
#define PIOE_PIO_IFSCDR			MMIO32(PIOE_BASE + 0x80)
/** PIOE_PIO_IFSCER Input Filter Slow Clock Enable Register **/
#define PIOE_PIO_IFSCER			MMIO32(PIOE_BASE + 0x84)
/** PIOE_PIO_IFSCSR Input Filter Slow Clock Status Register **/
#define PIOE_PIO_IFSCSR			MMIO32(PIOE_BASE + 0x88)
/** PIOE_PIO_SCDR Slow Clock Divider Debouncing Register **/
#define PIOE_PIO_SCDR			MMIO32(PIOE_BASE + 0x8c)
/** PIOE_PIO_PPDDR Pad Pull-down Disable Register **/
#define PIOE_PIO_PPDDR			MMIO32(PIOE_BASE + 0x90)
/** PIOE_PIO_PPDER Pad Pull-down Enable Register **/
#define PIOE_PIO_PPDER			MMIO32(PIOE_BASE + 0x94)
/** PIOE_PIO_PPDSR Pad Pull-down Status Register **/
#define PIOE_PIO_PPDSR			MMIO32(PIOE_BASE + 0x98)
/** PIOE_PIO_OWER Output Write Enable **/
#define PIOE_PIO_OWER			MMIO32(PIOE_BASE + 0xa0)
/** PIOE_PIO_OWDR Output Write Disable **/
#define PIOE_PIO_OWDR			MMIO32(PIOE_BASE + 0xa4)
/** PIOE_PIO_OWSR Output Write Status Register **/
#define PIOE_PIO_OWSR			MMIO32(PIOE_BASE + 0xa8)
/** PIOE_PIO_AIMER Additional Interrupt Modes Enable Register **/
#define PIOE_PIO_AIMER			MMIO32(PIOE_BASE + 0xb0)
/** PIOE_PIO_AIMDR Additional Interrupt Modes Disable Register **/
#define PIOE_PIO_AIMDR			MMIO32(PIOE_BASE + 0xb4)
/** PIOE_PIO_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOE_PIO_AIMMR			MMIO32(PIOE_BASE + 0xb8)
/** PIOE_PIO_ESR Edge Select Register **/
#define PIOE_PIO_ESR			MMIO32(PIOE_BASE + 0xc0)
/** PIOE_PIO_LSR Level Select Register **/
#define PIOE_PIO_LSR			MMIO32(PIOE_BASE + 0xc4)
/** PIOE_PIO_ELSR Edge/Level Status Register **/
#define PIOE_PIO_ELSR			MMIO32(PIOE_BASE + 0xc8)
/** PIOE_PIO_FELLSR Falling Edge/Low-Level Select Register **/
#define PIOE_PIO_FELLSR			MMIO32(PIOE_BASE + 0xd0)
/** PIOE_PIO_REHLSR Rising Edge/High-Level Select Register **/
#define PIOE_PIO_REHLSR			MMIO32(PIOE_BASE + 0xd4)
/** PIOE_PIO_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOE_PIO_FRLHSR			MMIO32(PIOE_BASE + 0xd8)
/** PIOE_PIO_LOCKSR Lock Status **/
#define PIOE_PIO_LOCKSR			MMIO32(PIOE_BASE + 0xe0)
/** PIOE_PIO_WPMR Write Protection Mode Register **/
#define PIOE_PIO_WPMR			MMIO32(PIOE_BASE + 0xe4)
/** PIOE_PIO_WPSR Write Protection Status Register **/
#define PIOE_PIO_WPSR			MMIO32(PIOE_BASE + 0xe8)
/** PIOE_PIO_SCHMITT Schmitt Trigger Register **/
#define PIOE_PIO_SCHMITT			MMIO32(PIOE_BASE + 0x100)
/** PIOE_PIO_DRIVER I/O Drive Register **/
#define PIOE_PIO_DRIVER			MMIO32(PIOE_BASE + 0x118)
/** PIOE_PIO_PCMR Parallel Capture Mode Register **/
#define PIOE_PIO_PCMR			MMIO32(PIOE_BASE + 0x150)
/** PIOE_PIO_PCIER Parallel Capture Interrupt Enable Register **/
#define PIOE_PIO_PCIER			MMIO32(PIOE_BASE + 0x154)
/** PIOE_PIO_PCIDR Parallel Capture Interrupt Disable Register **/
#define PIOE_PIO_PCIDR			MMIO32(PIOE_BASE + 0x158)
/** PIOE_PIO_PCIMR Parallel Capture Interrupt Mask Register **/
#define PIOE_PIO_PCIMR			MMIO32(PIOE_BASE + 0x15c)
/** PIOE_PIO_PCISR Parallel Capture Interrupt Status Register **/
#define PIOE_PIO_PCISR			MMIO32(PIOE_BASE + 0x160)
/** PIOE_PIO_PCRHR Parallel Capture Reception Holding Register **/
#define PIOE_PIO_PCRHR			MMIO32(PIOE_BASE + 0x164)

/**@}*/


/** @defgroup pioe_pio_per PIOPER PIO Enable Register
@{*/

/** PIOE_PIO_PER_P31 PIO Enable **/
#define PIOE_PIO_PER_P31		(1 << 31)
/** PIOE_PIO_PER_P30 PIO Enable **/
#define PIOE_PIO_PER_P30		(1 << 30)
/** PIOE_PIO_PER_P29 PIO Enable **/
#define PIOE_PIO_PER_P29		(1 << 29)
/** PIOE_PIO_PER_P28 PIO Enable **/
#define PIOE_PIO_PER_P28		(1 << 28)
/** PIOE_PIO_PER_P27 PIO Enable **/
#define PIOE_PIO_PER_P27		(1 << 27)
/** PIOE_PIO_PER_P26 PIO Enable **/
#define PIOE_PIO_PER_P26		(1 << 26)
/** PIOE_PIO_PER_P25 PIO Enable **/
#define PIOE_PIO_PER_P25		(1 << 25)
/** PIOE_PIO_PER_P24 PIO Enable **/
#define PIOE_PIO_PER_P24		(1 << 24)
/** PIOE_PIO_PER_P23 PIO Enable **/
#define PIOE_PIO_PER_P23		(1 << 23)
/** PIOE_PIO_PER_P22 PIO Enable **/
#define PIOE_PIO_PER_P22		(1 << 22)
/** PIOE_PIO_PER_P21 PIO Enable **/
#define PIOE_PIO_PER_P21		(1 << 21)
/** PIOE_PIO_PER_P20 PIO Enable **/
#define PIOE_PIO_PER_P20		(1 << 20)
/** PIOE_PIO_PER_P19 PIO Enable **/
#define PIOE_PIO_PER_P19		(1 << 19)
/** PIOE_PIO_PER_P18 PIO Enable **/
#define PIOE_PIO_PER_P18		(1 << 18)
/** PIOE_PIO_PER_P17 PIO Enable **/
#define PIOE_PIO_PER_P17		(1 << 17)
/** PIOE_PIO_PER_P16 PIO Enable **/
#define PIOE_PIO_PER_P16		(1 << 16)
/** PIOE_PIO_PER_P15 PIO Enable **/
#define PIOE_PIO_PER_P15		(1 << 15)
/** PIOE_PIO_PER_P14 PIO Enable **/
#define PIOE_PIO_PER_P14		(1 << 14)
/** PIOE_PIO_PER_P13 PIO Enable **/
#define PIOE_PIO_PER_P13		(1 << 13)
/** PIOE_PIO_PER_P12 PIO Enable **/
#define PIOE_PIO_PER_P12		(1 << 12)
/** PIOE_PIO_PER_P11 PIO Enable **/
#define PIOE_PIO_PER_P11		(1 << 11)
/** PIOE_PIO_PER_P10 PIO Enable **/
#define PIOE_PIO_PER_P10		(1 << 10)
/** PIOE_PIO_PER_P9 PIO Enable **/
#define PIOE_PIO_PER_P9		(1 << 9)
/** PIOE_PIO_PER_P8 PIO Enable **/
#define PIOE_PIO_PER_P8		(1 << 8)
/** PIOE_PIO_PER_P7 PIO Enable **/
#define PIOE_PIO_PER_P7		(1 << 7)
/** PIOE_PIO_PER_P6 PIO Enable **/
#define PIOE_PIO_PER_P6		(1 << 6)
/** PIOE_PIO_PER_P5 PIO Enable **/
#define PIOE_PIO_PER_P5		(1 << 5)
/** PIOE_PIO_PER_P4 PIO Enable **/
#define PIOE_PIO_PER_P4		(1 << 4)
/** PIOE_PIO_PER_P3 PIO Enable **/
#define PIOE_PIO_PER_P3		(1 << 3)
/** PIOE_PIO_PER_P2 PIO Enable **/
#define PIOE_PIO_PER_P2		(1 << 2)
/** PIOE_PIO_PER_P1 PIO Enable **/
#define PIOE_PIO_PER_P1		(1 << 1)
/** PIOE_PIO_PER_P0 PIO Enable **/
#define PIOE_PIO_PER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pdr PIOPDR PIO Disable Register
@{*/

/** PIOE_PIO_PDR_P31 PIO Disable **/
#define PIOE_PIO_PDR_P31		(1 << 31)
/** PIOE_PIO_PDR_P30 PIO Disable **/
#define PIOE_PIO_PDR_P30		(1 << 30)
/** PIOE_PIO_PDR_P29 PIO Disable **/
#define PIOE_PIO_PDR_P29		(1 << 29)
/** PIOE_PIO_PDR_P28 PIO Disable **/
#define PIOE_PIO_PDR_P28		(1 << 28)
/** PIOE_PIO_PDR_P27 PIO Disable **/
#define PIOE_PIO_PDR_P27		(1 << 27)
/** PIOE_PIO_PDR_P26 PIO Disable **/
#define PIOE_PIO_PDR_P26		(1 << 26)
/** PIOE_PIO_PDR_P25 PIO Disable **/
#define PIOE_PIO_PDR_P25		(1 << 25)
/** PIOE_PIO_PDR_P24 PIO Disable **/
#define PIOE_PIO_PDR_P24		(1 << 24)
/** PIOE_PIO_PDR_P23 PIO Disable **/
#define PIOE_PIO_PDR_P23		(1 << 23)
/** PIOE_PIO_PDR_P22 PIO Disable **/
#define PIOE_PIO_PDR_P22		(1 << 22)
/** PIOE_PIO_PDR_P21 PIO Disable **/
#define PIOE_PIO_PDR_P21		(1 << 21)
/** PIOE_PIO_PDR_P20 PIO Disable **/
#define PIOE_PIO_PDR_P20		(1 << 20)
/** PIOE_PIO_PDR_P19 PIO Disable **/
#define PIOE_PIO_PDR_P19		(1 << 19)
/** PIOE_PIO_PDR_P18 PIO Disable **/
#define PIOE_PIO_PDR_P18		(1 << 18)
/** PIOE_PIO_PDR_P17 PIO Disable **/
#define PIOE_PIO_PDR_P17		(1 << 17)
/** PIOE_PIO_PDR_P16 PIO Disable **/
#define PIOE_PIO_PDR_P16		(1 << 16)
/** PIOE_PIO_PDR_P15 PIO Disable **/
#define PIOE_PIO_PDR_P15		(1 << 15)
/** PIOE_PIO_PDR_P14 PIO Disable **/
#define PIOE_PIO_PDR_P14		(1 << 14)
/** PIOE_PIO_PDR_P13 PIO Disable **/
#define PIOE_PIO_PDR_P13		(1 << 13)
/** PIOE_PIO_PDR_P12 PIO Disable **/
#define PIOE_PIO_PDR_P12		(1 << 12)
/** PIOE_PIO_PDR_P11 PIO Disable **/
#define PIOE_PIO_PDR_P11		(1 << 11)
/** PIOE_PIO_PDR_P10 PIO Disable **/
#define PIOE_PIO_PDR_P10		(1 << 10)
/** PIOE_PIO_PDR_P9 PIO Disable **/
#define PIOE_PIO_PDR_P9		(1 << 9)
/** PIOE_PIO_PDR_P8 PIO Disable **/
#define PIOE_PIO_PDR_P8		(1 << 8)
/** PIOE_PIO_PDR_P7 PIO Disable **/
#define PIOE_PIO_PDR_P7		(1 << 7)
/** PIOE_PIO_PDR_P6 PIO Disable **/
#define PIOE_PIO_PDR_P6		(1 << 6)
/** PIOE_PIO_PDR_P5 PIO Disable **/
#define PIOE_PIO_PDR_P5		(1 << 5)
/** PIOE_PIO_PDR_P4 PIO Disable **/
#define PIOE_PIO_PDR_P4		(1 << 4)
/** PIOE_PIO_PDR_P3 PIO Disable **/
#define PIOE_PIO_PDR_P3		(1 << 3)
/** PIOE_PIO_PDR_P2 PIO Disable **/
#define PIOE_PIO_PDR_P2		(1 << 2)
/** PIOE_PIO_PDR_P1 PIO Disable **/
#define PIOE_PIO_PDR_P1		(1 << 1)
/** PIOE_PIO_PDR_P0 PIO Disable **/
#define PIOE_PIO_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_psr PIOPSR PIO Status Register
@{*/

/** PIOE_PIO_PSR_P31 PIO Status **/
#define PIOE_PIO_PSR_P31		(1 << 31)
/** PIOE_PIO_PSR_P30 PIO Status **/
#define PIOE_PIO_PSR_P30		(1 << 30)
/** PIOE_PIO_PSR_P29 PIO Status **/
#define PIOE_PIO_PSR_P29		(1 << 29)
/** PIOE_PIO_PSR_P28 PIO Status **/
#define PIOE_PIO_PSR_P28		(1 << 28)
/** PIOE_PIO_PSR_P27 PIO Status **/
#define PIOE_PIO_PSR_P27		(1 << 27)
/** PIOE_PIO_PSR_P26 PIO Status **/
#define PIOE_PIO_PSR_P26		(1 << 26)
/** PIOE_PIO_PSR_P25 PIO Status **/
#define PIOE_PIO_PSR_P25		(1 << 25)
/** PIOE_PIO_PSR_P24 PIO Status **/
#define PIOE_PIO_PSR_P24		(1 << 24)
/** PIOE_PIO_PSR_P23 PIO Status **/
#define PIOE_PIO_PSR_P23		(1 << 23)
/** PIOE_PIO_PSR_P22 PIO Status **/
#define PIOE_PIO_PSR_P22		(1 << 22)
/** PIOE_PIO_PSR_P21 PIO Status **/
#define PIOE_PIO_PSR_P21		(1 << 21)
/** PIOE_PIO_PSR_P20 PIO Status **/
#define PIOE_PIO_PSR_P20		(1 << 20)
/** PIOE_PIO_PSR_P19 PIO Status **/
#define PIOE_PIO_PSR_P19		(1 << 19)
/** PIOE_PIO_PSR_P18 PIO Status **/
#define PIOE_PIO_PSR_P18		(1 << 18)
/** PIOE_PIO_PSR_P17 PIO Status **/
#define PIOE_PIO_PSR_P17		(1 << 17)
/** PIOE_PIO_PSR_P16 PIO Status **/
#define PIOE_PIO_PSR_P16		(1 << 16)
/** PIOE_PIO_PSR_P15 PIO Status **/
#define PIOE_PIO_PSR_P15		(1 << 15)
/** PIOE_PIO_PSR_P14 PIO Status **/
#define PIOE_PIO_PSR_P14		(1 << 14)
/** PIOE_PIO_PSR_P13 PIO Status **/
#define PIOE_PIO_PSR_P13		(1 << 13)
/** PIOE_PIO_PSR_P12 PIO Status **/
#define PIOE_PIO_PSR_P12		(1 << 12)
/** PIOE_PIO_PSR_P11 PIO Status **/
#define PIOE_PIO_PSR_P11		(1 << 11)
/** PIOE_PIO_PSR_P10 PIO Status **/
#define PIOE_PIO_PSR_P10		(1 << 10)
/** PIOE_PIO_PSR_P9 PIO Status **/
#define PIOE_PIO_PSR_P9		(1 << 9)
/** PIOE_PIO_PSR_P8 PIO Status **/
#define PIOE_PIO_PSR_P8		(1 << 8)
/** PIOE_PIO_PSR_P7 PIO Status **/
#define PIOE_PIO_PSR_P7		(1 << 7)
/** PIOE_PIO_PSR_P6 PIO Status **/
#define PIOE_PIO_PSR_P6		(1 << 6)
/** PIOE_PIO_PSR_P5 PIO Status **/
#define PIOE_PIO_PSR_P5		(1 << 5)
/** PIOE_PIO_PSR_P4 PIO Status **/
#define PIOE_PIO_PSR_P4		(1 << 4)
/** PIOE_PIO_PSR_P3 PIO Status **/
#define PIOE_PIO_PSR_P3		(1 << 3)
/** PIOE_PIO_PSR_P2 PIO Status **/
#define PIOE_PIO_PSR_P2		(1 << 2)
/** PIOE_PIO_PSR_P1 PIO Status **/
#define PIOE_PIO_PSR_P1		(1 << 1)
/** PIOE_PIO_PSR_P0 PIO Status **/
#define PIOE_PIO_PSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_oer PIOOER Output Enable Register
@{*/

/** PIOE_PIO_OER_P31 Output Enable **/
#define PIOE_PIO_OER_P31		(1 << 31)
/** PIOE_PIO_OER_P30 Output Enable **/
#define PIOE_PIO_OER_P30		(1 << 30)
/** PIOE_PIO_OER_P29 Output Enable **/
#define PIOE_PIO_OER_P29		(1 << 29)
/** PIOE_PIO_OER_P28 Output Enable **/
#define PIOE_PIO_OER_P28		(1 << 28)
/** PIOE_PIO_OER_P27 Output Enable **/
#define PIOE_PIO_OER_P27		(1 << 27)
/** PIOE_PIO_OER_P26 Output Enable **/
#define PIOE_PIO_OER_P26		(1 << 26)
/** PIOE_PIO_OER_P25 Output Enable **/
#define PIOE_PIO_OER_P25		(1 << 25)
/** PIOE_PIO_OER_P24 Output Enable **/
#define PIOE_PIO_OER_P24		(1 << 24)
/** PIOE_PIO_OER_P23 Output Enable **/
#define PIOE_PIO_OER_P23		(1 << 23)
/** PIOE_PIO_OER_P22 Output Enable **/
#define PIOE_PIO_OER_P22		(1 << 22)
/** PIOE_PIO_OER_P21 Output Enable **/
#define PIOE_PIO_OER_P21		(1 << 21)
/** PIOE_PIO_OER_P20 Output Enable **/
#define PIOE_PIO_OER_P20		(1 << 20)
/** PIOE_PIO_OER_P19 Output Enable **/
#define PIOE_PIO_OER_P19		(1 << 19)
/** PIOE_PIO_OER_P18 Output Enable **/
#define PIOE_PIO_OER_P18		(1 << 18)
/** PIOE_PIO_OER_P17 Output Enable **/
#define PIOE_PIO_OER_P17		(1 << 17)
/** PIOE_PIO_OER_P16 Output Enable **/
#define PIOE_PIO_OER_P16		(1 << 16)
/** PIOE_PIO_OER_P15 Output Enable **/
#define PIOE_PIO_OER_P15		(1 << 15)
/** PIOE_PIO_OER_P14 Output Enable **/
#define PIOE_PIO_OER_P14		(1 << 14)
/** PIOE_PIO_OER_P13 Output Enable **/
#define PIOE_PIO_OER_P13		(1 << 13)
/** PIOE_PIO_OER_P12 Output Enable **/
#define PIOE_PIO_OER_P12		(1 << 12)
/** PIOE_PIO_OER_P11 Output Enable **/
#define PIOE_PIO_OER_P11		(1 << 11)
/** PIOE_PIO_OER_P10 Output Enable **/
#define PIOE_PIO_OER_P10		(1 << 10)
/** PIOE_PIO_OER_P9 Output Enable **/
#define PIOE_PIO_OER_P9		(1 << 9)
/** PIOE_PIO_OER_P8 Output Enable **/
#define PIOE_PIO_OER_P8		(1 << 8)
/** PIOE_PIO_OER_P7 Output Enable **/
#define PIOE_PIO_OER_P7		(1 << 7)
/** PIOE_PIO_OER_P6 Output Enable **/
#define PIOE_PIO_OER_P6		(1 << 6)
/** PIOE_PIO_OER_P5 Output Enable **/
#define PIOE_PIO_OER_P5		(1 << 5)
/** PIOE_PIO_OER_P4 Output Enable **/
#define PIOE_PIO_OER_P4		(1 << 4)
/** PIOE_PIO_OER_P3 Output Enable **/
#define PIOE_PIO_OER_P3		(1 << 3)
/** PIOE_PIO_OER_P2 Output Enable **/
#define PIOE_PIO_OER_P2		(1 << 2)
/** PIOE_PIO_OER_P1 Output Enable **/
#define PIOE_PIO_OER_P1		(1 << 1)
/** PIOE_PIO_OER_P0 Output Enable **/
#define PIOE_PIO_OER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_odr PIOODR Output Disable Register
@{*/

/** PIOE_PIO_ODR_P31 Output Disable **/
#define PIOE_PIO_ODR_P31		(1 << 31)
/** PIOE_PIO_ODR_P30 Output Disable **/
#define PIOE_PIO_ODR_P30		(1 << 30)
/** PIOE_PIO_ODR_P29 Output Disable **/
#define PIOE_PIO_ODR_P29		(1 << 29)
/** PIOE_PIO_ODR_P28 Output Disable **/
#define PIOE_PIO_ODR_P28		(1 << 28)
/** PIOE_PIO_ODR_P27 Output Disable **/
#define PIOE_PIO_ODR_P27		(1 << 27)
/** PIOE_PIO_ODR_P26 Output Disable **/
#define PIOE_PIO_ODR_P26		(1 << 26)
/** PIOE_PIO_ODR_P25 Output Disable **/
#define PIOE_PIO_ODR_P25		(1 << 25)
/** PIOE_PIO_ODR_P24 Output Disable **/
#define PIOE_PIO_ODR_P24		(1 << 24)
/** PIOE_PIO_ODR_P23 Output Disable **/
#define PIOE_PIO_ODR_P23		(1 << 23)
/** PIOE_PIO_ODR_P22 Output Disable **/
#define PIOE_PIO_ODR_P22		(1 << 22)
/** PIOE_PIO_ODR_P21 Output Disable **/
#define PIOE_PIO_ODR_P21		(1 << 21)
/** PIOE_PIO_ODR_P20 Output Disable **/
#define PIOE_PIO_ODR_P20		(1 << 20)
/** PIOE_PIO_ODR_P19 Output Disable **/
#define PIOE_PIO_ODR_P19		(1 << 19)
/** PIOE_PIO_ODR_P18 Output Disable **/
#define PIOE_PIO_ODR_P18		(1 << 18)
/** PIOE_PIO_ODR_P17 Output Disable **/
#define PIOE_PIO_ODR_P17		(1 << 17)
/** PIOE_PIO_ODR_P16 Output Disable **/
#define PIOE_PIO_ODR_P16		(1 << 16)
/** PIOE_PIO_ODR_P15 Output Disable **/
#define PIOE_PIO_ODR_P15		(1 << 15)
/** PIOE_PIO_ODR_P14 Output Disable **/
#define PIOE_PIO_ODR_P14		(1 << 14)
/** PIOE_PIO_ODR_P13 Output Disable **/
#define PIOE_PIO_ODR_P13		(1 << 13)
/** PIOE_PIO_ODR_P12 Output Disable **/
#define PIOE_PIO_ODR_P12		(1 << 12)
/** PIOE_PIO_ODR_P11 Output Disable **/
#define PIOE_PIO_ODR_P11		(1 << 11)
/** PIOE_PIO_ODR_P10 Output Disable **/
#define PIOE_PIO_ODR_P10		(1 << 10)
/** PIOE_PIO_ODR_P9 Output Disable **/
#define PIOE_PIO_ODR_P9		(1 << 9)
/** PIOE_PIO_ODR_P8 Output Disable **/
#define PIOE_PIO_ODR_P8		(1 << 8)
/** PIOE_PIO_ODR_P7 Output Disable **/
#define PIOE_PIO_ODR_P7		(1 << 7)
/** PIOE_PIO_ODR_P6 Output Disable **/
#define PIOE_PIO_ODR_P6		(1 << 6)
/** PIOE_PIO_ODR_P5 Output Disable **/
#define PIOE_PIO_ODR_P5		(1 << 5)
/** PIOE_PIO_ODR_P4 Output Disable **/
#define PIOE_PIO_ODR_P4		(1 << 4)
/** PIOE_PIO_ODR_P3 Output Disable **/
#define PIOE_PIO_ODR_P3		(1 << 3)
/** PIOE_PIO_ODR_P2 Output Disable **/
#define PIOE_PIO_ODR_P2		(1 << 2)
/** PIOE_PIO_ODR_P1 Output Disable **/
#define PIOE_PIO_ODR_P1		(1 << 1)
/** PIOE_PIO_ODR_P0 Output Disable **/
#define PIOE_PIO_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_osr PIOOSR Output Status Register
@{*/

/** PIOE_PIO_OSR_P31 Output Status **/
#define PIOE_PIO_OSR_P31		(1 << 31)
/** PIOE_PIO_OSR_P30 Output Status **/
#define PIOE_PIO_OSR_P30		(1 << 30)
/** PIOE_PIO_OSR_P29 Output Status **/
#define PIOE_PIO_OSR_P29		(1 << 29)
/** PIOE_PIO_OSR_P28 Output Status **/
#define PIOE_PIO_OSR_P28		(1 << 28)
/** PIOE_PIO_OSR_P27 Output Status **/
#define PIOE_PIO_OSR_P27		(1 << 27)
/** PIOE_PIO_OSR_P26 Output Status **/
#define PIOE_PIO_OSR_P26		(1 << 26)
/** PIOE_PIO_OSR_P25 Output Status **/
#define PIOE_PIO_OSR_P25		(1 << 25)
/** PIOE_PIO_OSR_P24 Output Status **/
#define PIOE_PIO_OSR_P24		(1 << 24)
/** PIOE_PIO_OSR_P23 Output Status **/
#define PIOE_PIO_OSR_P23		(1 << 23)
/** PIOE_PIO_OSR_P22 Output Status **/
#define PIOE_PIO_OSR_P22		(1 << 22)
/** PIOE_PIO_OSR_P21 Output Status **/
#define PIOE_PIO_OSR_P21		(1 << 21)
/** PIOE_PIO_OSR_P20 Output Status **/
#define PIOE_PIO_OSR_P20		(1 << 20)
/** PIOE_PIO_OSR_P19 Output Status **/
#define PIOE_PIO_OSR_P19		(1 << 19)
/** PIOE_PIO_OSR_P18 Output Status **/
#define PIOE_PIO_OSR_P18		(1 << 18)
/** PIOE_PIO_OSR_P17 Output Status **/
#define PIOE_PIO_OSR_P17		(1 << 17)
/** PIOE_PIO_OSR_P16 Output Status **/
#define PIOE_PIO_OSR_P16		(1 << 16)
/** PIOE_PIO_OSR_P15 Output Status **/
#define PIOE_PIO_OSR_P15		(1 << 15)
/** PIOE_PIO_OSR_P14 Output Status **/
#define PIOE_PIO_OSR_P14		(1 << 14)
/** PIOE_PIO_OSR_P13 Output Status **/
#define PIOE_PIO_OSR_P13		(1 << 13)
/** PIOE_PIO_OSR_P12 Output Status **/
#define PIOE_PIO_OSR_P12		(1 << 12)
/** PIOE_PIO_OSR_P11 Output Status **/
#define PIOE_PIO_OSR_P11		(1 << 11)
/** PIOE_PIO_OSR_P10 Output Status **/
#define PIOE_PIO_OSR_P10		(1 << 10)
/** PIOE_PIO_OSR_P9 Output Status **/
#define PIOE_PIO_OSR_P9		(1 << 9)
/** PIOE_PIO_OSR_P8 Output Status **/
#define PIOE_PIO_OSR_P8		(1 << 8)
/** PIOE_PIO_OSR_P7 Output Status **/
#define PIOE_PIO_OSR_P7		(1 << 7)
/** PIOE_PIO_OSR_P6 Output Status **/
#define PIOE_PIO_OSR_P6		(1 << 6)
/** PIOE_PIO_OSR_P5 Output Status **/
#define PIOE_PIO_OSR_P5		(1 << 5)
/** PIOE_PIO_OSR_P4 Output Status **/
#define PIOE_PIO_OSR_P4		(1 << 4)
/** PIOE_PIO_OSR_P3 Output Status **/
#define PIOE_PIO_OSR_P3		(1 << 3)
/** PIOE_PIO_OSR_P2 Output Status **/
#define PIOE_PIO_OSR_P2		(1 << 2)
/** PIOE_PIO_OSR_P1 Output Status **/
#define PIOE_PIO_OSR_P1		(1 << 1)
/** PIOE_PIO_OSR_P0 Output Status **/
#define PIOE_PIO_OSR_P0		(1 << 0)

/**@}*/

