grevaillot/svd_tools/headers/ATSAMV71Q20B/pioe.h
/** PIOE_PIO_PUER_P31 Pull-Up Enable **/
#define PIOE_PIO_PUER_P31		(1 << 31)
/** PIOE_PIO_PUER_P30 Pull-Up Enable **/
#define PIOE_PIO_PUER_P30		(1 << 30)
/** PIOE_PIO_PUER_P29 Pull-Up Enable **/
#define PIOE_PIO_PUER_P29		(1 << 29)
/** PIOE_PIO_PUER_P28 Pull-Up Enable **/
#define PIOE_PIO_PUER_P28		(1 << 28)
/** PIOE_PIO_PUER_P27 Pull-Up Enable **/
#define PIOE_PIO_PUER_P27		(1 << 27)
/** PIOE_PIO_PUER_P26 Pull-Up Enable **/
#define PIOE_PIO_PUER_P26		(1 << 26)
/** PIOE_PIO_PUER_P25 Pull-Up Enable **/
#define PIOE_PIO_PUER_P25		(1 << 25)
/** PIOE_PIO_PUER_P24 Pull-Up Enable **/
#define PIOE_PIO_PUER_P24		(1 << 24)
/** PIOE_PIO_PUER_P23 Pull-Up Enable **/
#define PIOE_PIO_PUER_P23		(1 << 23)
/** PIOE_PIO_PUER_P22 Pull-Up Enable **/
#define PIOE_PIO_PUER_P22		(1 << 22)
/** PIOE_PIO_PUER_P21 Pull-Up Enable **/
#define PIOE_PIO_PUER_P21		(1 << 21)
/** PIOE_PIO_PUER_P20 Pull-Up Enable **/
#define PIOE_PIO_PUER_P20		(1 << 20)
/** PIOE_PIO_PUER_P19 Pull-Up Enable **/
#define PIOE_PIO_PUER_P19		(1 << 19)
/** PIOE_PIO_PUER_P18 Pull-Up Enable **/
#define PIOE_PIO_PUER_P18		(1 << 18)
/** PIOE_PIO_PUER_P17 Pull-Up Enable **/
#define PIOE_PIO_PUER_P17		(1 << 17)
/** PIOE_PIO_PUER_P16 Pull-Up Enable **/
#define PIOE_PIO_PUER_P16		(1 << 16)
/** PIOE_PIO_PUER_P15 Pull-Up Enable **/
#define PIOE_PIO_PUER_P15		(1 << 15)
/** PIOE_PIO_PUER_P14 Pull-Up Enable **/
#define PIOE_PIO_PUER_P14		(1 << 14)
/** PIOE_PIO_PUER_P13 Pull-Up Enable **/
#define PIOE_PIO_PUER_P13		(1 << 13)
/** PIOE_PIO_PUER_P12 Pull-Up Enable **/
#define PIOE_PIO_PUER_P12		(1 << 12)
/** PIOE_PIO_PUER_P11 Pull-Up Enable **/
#define PIOE_PIO_PUER_P11		(1 << 11)
/** PIOE_PIO_PUER_P10 Pull-Up Enable **/
#define PIOE_PIO_PUER_P10		(1 << 10)
/** PIOE_PIO_PUER_P9 Pull-Up Enable **/
#define PIOE_PIO_PUER_P9		(1 << 9)
/** PIOE_PIO_PUER_P8 Pull-Up Enable **/
#define PIOE_PIO_PUER_P8		(1 << 8)
/** PIOE_PIO_PUER_P7 Pull-Up Enable **/
#define PIOE_PIO_PUER_P7		(1 << 7)
/** PIOE_PIO_PUER_P6 Pull-Up Enable **/
#define PIOE_PIO_PUER_P6		(1 << 6)
/** PIOE_PIO_PUER_P5 Pull-Up Enable **/
#define PIOE_PIO_PUER_P5		(1 << 5)
/** PIOE_PIO_PUER_P4 Pull-Up Enable **/
#define PIOE_PIO_PUER_P4		(1 << 4)
/** PIOE_PIO_PUER_P3 Pull-Up Enable **/
#define PIOE_PIO_PUER_P3		(1 << 3)
/** PIOE_PIO_PUER_P2 Pull-Up Enable **/
#define PIOE_PIO_PUER_P2		(1 << 2)
/** PIOE_PIO_PUER_P1 Pull-Up Enable **/
#define PIOE_PIO_PUER_P1		(1 << 1)
/** PIOE_PIO_PUER_P0 Pull-Up Enable **/
#define PIOE_PIO_PUER_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_pusr PIOPUSR Pad Pull-up Status Register
@{*/

/** PIOE_PIO_PUSR_P31 Pull-Up Status **/
#define PIOE_PIO_PUSR_P31		(1 << 31)
/** PIOE_PIO_PUSR_P30 Pull-Up Status **/
#define PIOE_PIO_PUSR_P30		(1 << 30)
/** PIOE_PIO_PUSR_P29 Pull-Up Status **/
#define PIOE_PIO_PUSR_P29		(1 << 29)
/** PIOE_PIO_PUSR_P28 Pull-Up Status **/
#define PIOE_PIO_PUSR_P28		(1 << 28)
/** PIOE_PIO_PUSR_P27 Pull-Up Status **/
#define PIOE_PIO_PUSR_P27		(1 << 27)
/** PIOE_PIO_PUSR_P26 Pull-Up Status **/
#define PIOE_PIO_PUSR_P26		(1 << 26)
/** PIOE_PIO_PUSR_P25 Pull-Up Status **/
#define PIOE_PIO_PUSR_P25		(1 << 25)
/** PIOE_PIO_PUSR_P24 Pull-Up Status **/
#define PIOE_PIO_PUSR_P24		(1 << 24)
/** PIOE_PIO_PUSR_P23 Pull-Up Status **/
#define PIOE_PIO_PUSR_P23		(1 << 23)
/** PIOE_PIO_PUSR_P22 Pull-Up Status **/
#define PIOE_PIO_PUSR_P22		(1 << 22)
/** PIOE_PIO_PUSR_P21 Pull-Up Status **/
#define PIOE_PIO_PUSR_P21		(1 << 21)
/** PIOE_PIO_PUSR_P20 Pull-Up Status **/
#define PIOE_PIO_PUSR_P20		(1 << 20)
/** PIOE_PIO_PUSR_P19 Pull-Up Status **/
#define PIOE_PIO_PUSR_P19		(1 << 19)
/** PIOE_PIO_PUSR_P18 Pull-Up Status **/
#define PIOE_PIO_PUSR_P18		(1 << 18)
/** PIOE_PIO_PUSR_P17 Pull-Up Status **/
#define PIOE_PIO_PUSR_P17		(1 << 17)
/** PIOE_PIO_PUSR_P16 Pull-Up Status **/
#define PIOE_PIO_PUSR_P16		(1 << 16)
/** PIOE_PIO_PUSR_P15 Pull-Up Status **/
#define PIOE_PIO_PUSR_P15		(1 << 15)
/** PIOE_PIO_PUSR_P14 Pull-Up Status **/
#define PIOE_PIO_PUSR_P14		(1 << 14)
/** PIOE_PIO_PUSR_P13 Pull-Up Status **/
#define PIOE_PIO_PUSR_P13		(1 << 13)
/** PIOE_PIO_PUSR_P12 Pull-Up Status **/
#define PIOE_PIO_PUSR_P12		(1 << 12)
/** PIOE_PIO_PUSR_P11 Pull-Up Status **/
#define PIOE_PIO_PUSR_P11		(1 << 11)
/** PIOE_PIO_PUSR_P10 Pull-Up Status **/
#define PIOE_PIO_PUSR_P10		(1 << 10)
/** PIOE_PIO_PUSR_P9 Pull-Up Status **/
#define PIOE_PIO_PUSR_P9		(1 << 9)
/** PIOE_PIO_PUSR_P8 Pull-Up Status **/
#define PIOE_PIO_PUSR_P8		(1 << 8)
/** PIOE_PIO_PUSR_P7 Pull-Up Status **/
#define PIOE_PIO_PUSR_P7		(1 << 7)
/** PIOE_PIO_PUSR_P6 Pull-Up Status **/
#define PIOE_PIO_PUSR_P6		(1 << 6)
/** PIOE_PIO_PUSR_P5 Pull-Up Status **/
#define PIOE_PIO_PUSR_P5		(1 << 5)
/** PIOE_PIO_PUSR_P4 Pull-Up Status **/
#define PIOE_PIO_PUSR_P4		(1 << 4)
/** PIOE_PIO_PUSR_P3 Pull-Up Status **/
#define PIOE_PIO_PUSR_P3		(1 << 3)
/** PIOE_PIO_PUSR_P2 Pull-Up Status **/
#define PIOE_PIO_PUSR_P2		(1 << 2)
/** PIOE_PIO_PUSR_P1 Pull-Up Status **/
#define PIOE_PIO_PUSR_P1		(1 << 1)
/** PIOE_PIO_PUSR_P0 Pull-Up Status **/
#define PIOE_PIO_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_abcdsr[0] PIOABCDSR[0] Peripheral ABCD Select Register 0
@{*/

/** PIOE_PIO_ABCDSR[0]_P31 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P31		(1 << 31)
/** PIOE_PIO_ABCDSR[0]_P30 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P30		(1 << 30)
/** PIOE_PIO_ABCDSR[0]_P29 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P29		(1 << 29)
/** PIOE_PIO_ABCDSR[0]_P28 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P28		(1 << 28)
/** PIOE_PIO_ABCDSR[0]_P27 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P27		(1 << 27)
/** PIOE_PIO_ABCDSR[0]_P26 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P26		(1 << 26)
/** PIOE_PIO_ABCDSR[0]_P25 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P25		(1 << 25)
/** PIOE_PIO_ABCDSR[0]_P24 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P24		(1 << 24)
/** PIOE_PIO_ABCDSR[0]_P23 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P23		(1 << 23)
/** PIOE_PIO_ABCDSR[0]_P22 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P22		(1 << 22)
/** PIOE_PIO_ABCDSR[0]_P21 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P21		(1 << 21)
/** PIOE_PIO_ABCDSR[0]_P20 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P20		(1 << 20)
/** PIOE_PIO_ABCDSR[0]_P19 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P19		(1 << 19)
/** PIOE_PIO_ABCDSR[0]_P18 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P18		(1 << 18)
/** PIOE_PIO_ABCDSR[0]_P17 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P17		(1 << 17)
/** PIOE_PIO_ABCDSR[0]_P16 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P16		(1 << 16)
/** PIOE_PIO_ABCDSR[0]_P15 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P15		(1 << 15)
/** PIOE_PIO_ABCDSR[0]_P14 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P14		(1 << 14)
/** PIOE_PIO_ABCDSR[0]_P13 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P13		(1 << 13)
/** PIOE_PIO_ABCDSR[0]_P12 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P12		(1 << 12)
/** PIOE_PIO_ABCDSR[0]_P11 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P11		(1 << 11)
/** PIOE_PIO_ABCDSR[0]_P10 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P10		(1 << 10)
/** PIOE_PIO_ABCDSR[0]_P9 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P9		(1 << 9)
/** PIOE_PIO_ABCDSR[0]_P8 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P8		(1 << 8)
/** PIOE_PIO_ABCDSR[0]_P7 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P7		(1 << 7)
/** PIOE_PIO_ABCDSR[0]_P6 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P6		(1 << 6)
/** PIOE_PIO_ABCDSR[0]_P5 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P5		(1 << 5)
/** PIOE_PIO_ABCDSR[0]_P4 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P4		(1 << 4)
/** PIOE_PIO_ABCDSR[0]_P3 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P3		(1 << 3)
/** PIOE_PIO_ABCDSR[0]_P2 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P2		(1 << 2)
/** PIOE_PIO_ABCDSR[0]_P1 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P1		(1 << 1)
/** PIOE_PIO_ABCDSR[0]_P0 Peripheral Select **/
#define PIOE_PIO_ABCDSR[0]_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_abcdsr[1] PIOABCDSR[1] Peripheral ABCD Select Register 0
@{*/

