grevaillot/svd_tools/headers/ATSAMV71Q20B/pioe.h
/** @defgroup pioe_pio_lsr PIOLSR Level Select Register
@{*/

/** PIOE_PIO_LSR_P31 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P31		(1 << 31)
/** PIOE_PIO_LSR_P30 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P30		(1 << 30)
/** PIOE_PIO_LSR_P29 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P29		(1 << 29)
/** PIOE_PIO_LSR_P28 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P28		(1 << 28)
/** PIOE_PIO_LSR_P27 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P27		(1 << 27)
/** PIOE_PIO_LSR_P26 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P26		(1 << 26)
/** PIOE_PIO_LSR_P25 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P25		(1 << 25)
/** PIOE_PIO_LSR_P24 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P24		(1 << 24)
/** PIOE_PIO_LSR_P23 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P23		(1 << 23)
/** PIOE_PIO_LSR_P22 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P22		(1 << 22)
/** PIOE_PIO_LSR_P21 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P21		(1 << 21)
/** PIOE_PIO_LSR_P20 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P20		(1 << 20)
/** PIOE_PIO_LSR_P19 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P19		(1 << 19)
/** PIOE_PIO_LSR_P18 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P18		(1 << 18)
/** PIOE_PIO_LSR_P17 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P17		(1 << 17)
/** PIOE_PIO_LSR_P16 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P16		(1 << 16)
/** PIOE_PIO_LSR_P15 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P15		(1 << 15)
/** PIOE_PIO_LSR_P14 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P14		(1 << 14)
/** PIOE_PIO_LSR_P13 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P13		(1 << 13)
/** PIOE_PIO_LSR_P12 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P12		(1 << 12)
/** PIOE_PIO_LSR_P11 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P11		(1 << 11)
/** PIOE_PIO_LSR_P10 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P10		(1 << 10)
/** PIOE_PIO_LSR_P9 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P9		(1 << 9)
/** PIOE_PIO_LSR_P8 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P8		(1 << 8)
/** PIOE_PIO_LSR_P7 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P7		(1 << 7)
/** PIOE_PIO_LSR_P6 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P6		(1 << 6)
/** PIOE_PIO_LSR_P5 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P5		(1 << 5)
/** PIOE_PIO_LSR_P4 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P4		(1 << 4)
/** PIOE_PIO_LSR_P3 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P3		(1 << 3)
/** PIOE_PIO_LSR_P2 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P2		(1 << 2)
/** PIOE_PIO_LSR_P1 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P1		(1 << 1)
/** PIOE_PIO_LSR_P0 Level Interrupt Selection **/
#define PIOE_PIO_LSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioe_pio_elsr PIOELSR Edge/Level Status Register
@{*/

/** PIOE_PIO_ELSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P31		(1 << 31)
/** PIOE_PIO_ELSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P30		(1 << 30)
/** PIOE_PIO_ELSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P29		(1 << 29)
/** PIOE_PIO_ELSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P28		(1 << 28)
/** PIOE_PIO_ELSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P27		(1 << 27)
/** PIOE_PIO_ELSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P26		(1 << 26)
/** PIOE_PIO_ELSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P25		(1 << 25)
/** PIOE_PIO_ELSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P24		(1 << 24)
/** PIOE_PIO_ELSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P23		(1 << 23)
/** PIOE_PIO_ELSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P22		(1 << 22)
/** PIOE_PIO_ELSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P21		(1 << 21)
/** PIOE_PIO_ELSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P20		(1 << 20)
/** PIOE_PIO_ELSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P19		(1 << 19)
/** PIOE_PIO_ELSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P18		(1 << 18)
/** PIOE_PIO_ELSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P17		(1 << 17)
/** PIOE_PIO_ELSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P16		(1 << 16)
/** PIOE_PIO_ELSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P15		(1 << 15)
/** PIOE_PIO_ELSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P14		(1 << 14)
/** PIOE_PIO_ELSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P13		(1 << 13)
/** PIOE_PIO_ELSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P12		(1 << 12)
/** PIOE_PIO_ELSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P11		(1 << 11)
/** PIOE_PIO_ELSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P10		(1 << 10)
/** PIOE_PIO_ELSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P9		(1 << 9)
/** PIOE_PIO_ELSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P8		(1 << 8)
/** PIOE_PIO_ELSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P7		(1 << 7)
/** PIOE_PIO_ELSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P6		(1 << 6)
/** PIOE_PIO_ELSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P5		(1 << 5)
/** PIOE_PIO_ELSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P4		(1 << 4)
/** PIOE_PIO_ELSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P3		(1 << 3)
/** PIOE_PIO_ELSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P2		(1 << 2)
/** PIOE_PIO_ELSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P1		(1 << 1)
/** PIOE_PIO_ELSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOE_PIO_ELSR_P0		(1 << 0)

/**@}*/

